<template>
  <div id="app">
    <h1>快篩站轉CDC格式</h1>
    <p>選擇快篩站報表(.xlsx)，即會跳出轉換的檔案供存擋</p>
    <div>
      <input type="file" @change="handleFileChange" ref="fileInput">
    </div>
  </div>
</template>

<script>
import readXlsxFile from 'read-excel-file'
import xlsx from 'xlsx'

const addressMap = {
  "基隆": {
    "中正": "1101",
    "七堵": "1102",
    "暖暖": "1103",
    "仁愛": "1104",
    "中山": "1105",
    "安樂": "1106",
    "信義": "1107"
  },
  "台北": {
    "松山": "0101",
    "大安": "0102",
    "大同": "0109",
    "中山": "0110",
    "內湖": "0111",
    "南港": "0112",
    "士林": "0115",
    "北投": "0116",
    "信義": "0117",
    "中正": "0118",
    "萬華": "0119",
    "文山": "0120"
  },
  "新北": {
    "板橋": "3101",
    "三重": "3102",
    "永和": "3103",
    "中和": "3104",
    "新店": "3105",
    "新莊": "3106",
    "樹林": "3107",
    "鶯歌": "3108",
    "三峽": "3109",
    "淡水": "3110",
    "汐止": "3111",
    "瑞芳": "3112",
    "土城": "3113",
    "蘆洲": "3114",
    "五股": "3115",
    "泰山": "3116",
    "林口": "3117",
    "深坑": "3118",
    "石碇": "3119",
    "坪林": "3120",
    "三芝": "3121",
    "石門": "3122",
    "八里": "3123",
    "平溪": "3124",
    "雙溪": "3125",
    "貢寮": "3126",
    "金山": "3127",
    "萬里": "3128",
    "烏來": "3129"
  },
  "桃園": {
    "桃園": "3201",
    "中壢": "3202",
    "大溪": "3203",
    "楊梅": "3204",
    "蘆竹": "3205",
    "大園": "3206",
    "龜山": "3207",
    "八德": "3208",
    "龍潭": "3209",
    "平鎮": "3210",
    "新屋": "3211",
    "觀音": "3212",
    "復興": "3213"
  },
  "新竹": {
    "東": "1201",
    "北": "1204",
    "香山": "1205",
    "關西": "3301",
    "新埔": "3302",
    "竹東": "3303",
    "竹北": "3305",
    "湖口": "3306",
    "橫山": "3307",
    "新豐": "3308",
    "芎林": "3309",
    "寶山": "3310",
    "北埔": "3311",
    "峨眉": "3312",
    "尖石": "3313",
    "五峰": "3314"
  },
  "苗栗": {
    "苗栗": "3501",
    "苑裡": "3502",
    "通霄": "3503",
    "竹南": "3504",
    "頭份": "3505",
    "後龍": "3506",
    "卓蘭": "3507",
    "大湖": "3508",
    "公館": "3509",
    "銅鑼": "3510",
    "南庄": "3511",
    "頭屋": "3512",
    "三義": "3513",
    "西湖": "3514",
    "造橋": "3515",
    "三灣": "3516",
    "獅潭": "3517",
    "泰安": "3518"
  },
  "台中": {
    "豐原": "0301",
    "東勢": "0302",
    "大甲": "0303",
    "清水": "0304",
    "沙鹿": "0305",
    "梧棲": "0306",
    "后里": "0307",
    "神岡": "0308",
    "潭子": "0309",
    "大雅": "0310",
    "新社": "0311",
    "石岡": "0312",
    "外埔": "0313",
    "大安": "0314",
    "烏日": "0315",
    "大肚": "0316",
    "龍井": "0317",
    "霧峰": "0318",
    "太平": "0319",
    "大里": "0320",
    "和平": "0321",
    "中": "0322",
    "東": "0323",
    "西": "0324",
    "南": "0325",
    "北": "0326",
    "西屯": "0327",
    "南屯": "0328",
    "北屯": "0329"
  },
  "彰化": {
    "彰化": "3701",
    "鹿港": "3702",
    "和美": "3703",
    "北斗": "3704",
    "員林": "3705",
    "溪湖": "3706",
    "田中": "3707",
    "二林": "3708",
    "線西": "3709",
    "伸港": "3710",
    "福興": "3711",
    "秀水": "3712",
    "花壇": "3713",
    "芬園": "3714",
    "大村": "3715",
    "埔鹽": "3716",
    "埔心": "3717",
    "永靖": "3718",
    "社頭": "3719",
    "二水": "3720",
    "田尾": "3721",
    "埤頭": "3722",
    "芳苑": "3723",
    "大城": "3724",
    "竹塘": "3725",
    "溪州": "3726"
  },
  "南投": {
    "南投": "3801",
    "埔里": "3802",
    "草屯": "3803",
    "竹山": "3804",
    "集集": "3805",
    "名間": "3806",
    "鹿谷": "3807",
    "中寮": "3808",
    "魚池": "3809",
    "國姓": "3810",
    "水里": "3811",
    "信義": "3812",
    "仁愛": "3813"
  },
  "雲林": {
    "斗六": "3901",
    "斗南": "3902",
    "虎尾": "3903",
    "西螺": "3904",
    "土庫": "3905",
    "北港": "3906",
    "古坑": "3907",
    "大埤": "3908",
    "莿桐": "3909",
    "林內": "3910",
    "二崙": "3911",
    "崙背": "3912",
    "麥寮": "3913",
    "東勢": "3914",
    "褒忠": "3915",
    "台西": "3916",
    "元長": "3917",
    "四湖": "3918",
    "口湖": "3919",
    "水林": "3920"
  },
  "嘉義": {
    "東": "2201",
    "西": "2202",
    "朴子": "4001",
    "布袋": "4002",
    "大林": "4003",
    "民雄": "4004",
    "溪口": "4005",
    "新港": "4006",
    "六腳": "4007",
    "東石": "4008",
    "義竹": "4009",
    "鹿草": "4010",
    "太保": "4011",
    "水上": "4012",
    "中埔": "4013",
    "竹崎": "4014",
    "梅山": "4015",
    "番路": "4016",
    "大埔": "4017",
    "阿里山": "4018"
  },
  "台南": {
    "新營": "0501",
    "鹽水": "0502",
    "白河": "0503",
    "麻豆": "0504",
    "佳里": "0505",
    "新化": "0506",
    "善化": "0507",
    "學甲": "0508",
    "柳營": "0509",
    "後壁": "0510",
    "東山": "0511",
    "下營": "0512",
    "六甲": "0513",
    "官田": "0514",
    "大內": "0515",
    "西港": "0516",
    "七股": "0517",
    "將軍": "0518",
    "北門": "0519",
    "新市": "0520",
    "安定": "0521",
    "山上": "0522",
    "玉井": "0523",
    "楠西": "0524",
    "南化": "0525",
    "左鎮": "0526",
    "仁德": "0527",
    "歸仁": "0528",
    "關廟": "0529",
    "龍崎": "0530",
    "永康": "0531",
    "東": "0532",
    "南": "0533",
    "中西": "0534",
    "北": "0535",
    "安南": "0537",
    "安平": "0538"
  },
  "高雄": {
    "鳳山": "0701",
    "岡山": "0702",
    "旗山": "0703",
    "美濃": "0704",
    "林園": "0705",
    "大寮": "0706",
    "大樹": "0707",
    "仁武": "0708",
    "大社": "0709",
    "鳥松": "0710",
    "橋頭": "0711",
    "燕巢": "0712",
    "田寮": "0713",
    "阿蓮": "0714",
    "路竹": "0715",
    "湖內": "0716",
    "茄萣": "0717",
    "永安": "0718",
    "彌陀": "0719",
    "梓官": "0720",
    "六龜": "0721",
    "甲仙": "0722",
    "杉林": "0723",
    "內門": "0724",
    "茂林": "0725",
    "桃源": "0726",
    "那瑪夏": "0727",
    "鹽埕": "0728",
    "鼓山": "0729",
    "左營": "0730",
    "楠梓": "0731",
    "三民": "0732",
    "新興": "0733",
    "前金": "0734",
    "苓雅": "0735",
    "前鎮": "0736",
    "旗津": "0737",
    "小港": "0738"
  },
  "屏東": {
    "屏東": "4301",
    "潮州": "4302",
    "東港": "4303",
    "恆春": "4304",
    "萬丹": "4305",
    "長治": "4306",
    "麟洛": "4307",
    "九如": "4308",
    "里港": "4309",
    "鹽埔": "4310",
    "高樹": "4311",
    "萬巒": "4312",
    "內埔": "4313",
    "竹田": "4314",
    "新埤": "4315",
    "枋寮": "4316",
    "新園": "4317",
    "崁頂": "4318",
    "林邊": "4319",
    "南州": "4320",
    "佳冬": "4321",
    "琉球": "4322",
    "車城": "4323",
    "滿州": "4324",
    "枋山": "4325",
    "三地門": "4326",
    "霧台": "4327",
    "瑪家": "4328",
    "泰武": "4329",
    "來義": "4330",
    "春日": "4331",
    "獅子": "4332",
    "牡丹": "4333"
  },
  "宜蘭": {
    "宜蘭": "3401",
    "羅東": "3402",
    "蘇澳": "3403",
    "頭城": "3404",
    "礁溪": "3405",
    "壯圍": "3406",
    "員山": "3407",
    "冬山": "3408",
    "五結": "3409",
    "三星": "3410",
    "大同": "3411",
    "南澳": "3412"
  },
  "花蓮": {
    "花蓮": "4501",
    "鳳林": "4502",
    "玉里": "4503",
    "新城": "4504",
    "吉安": "4505",
    "壽豐": "4506",
    "光復": "4507",
    "豐濱": "4508",
    "瑞穗": "4509",
    "富里": "4510",
    "秀林": "4511",
    "萬榮": "4512",
    "卓溪": "4513"
  },
  "台東": {
    "台東": "4601",
    "成功": "4602",
    "關山": "4603",
    "卑南": "4604",
    "大武": "4605",
    "太麻里": "4606",
    "東河": "4607",
    "長濱": "4608",
    "鹿野": "4609",
    "池上": "4610",
    "綠島": "4611",
    "延平": "4612",
    "海端": "4613",
    "達仁": "4614",
    "金峰": "4615",
    "蘭嶼": "4616"
  },
  "澎湖": {
    "馬公": "4401",
    "湖西": "4402",
    "白沙": "4403",
    "西嶼": "4404",
    "望安": "4405",
    "七美": "4406"
  },
  "金門": {
    "金城": "9001",
    "金沙": "9002",
    "金湖": "9003",
    "金寧": "9004",
    "烈嶼": "9005",
    "烏坵": "9006"
  },
  "連江": {
    "南竿": "9101",
    "北竿": "9102",
    "莒光": "9103",
    "東引": "9104"
  }
}

export default {
  name: 'App',
  methods: {
    handleFileChange(e) {
      let file = e.target.files[0];
      readXlsxFile(file).then((rows) => {
        console.log(rows)
        this.exportCdcExcel(rows, file.name.split('.')[0])
      })
    },
    exportCdcExcel(rows, name) {
      rows.shift()

      let jsonData = rows.map(row => {
        return {
          "身份證字號/護照號碼(不可超過10碼)": row[5],
          "姓名(不可超過30字)": row[4],
          "出生日期(請依格式填寫)": this.formatBirthday(row[8]),
          "性別(請選代碼)": row[7] === '男' ? 'M' : 'F',
          "職業(請選代碼)": '',
          "國籍別暨非本國居民身分(請選代碼)": '',
          "國家(請選代碼)": '',
          "公司電話(選填/不可超過30碼)": row[11],
          "手機號碼(選填/不可超過30碼)": row[12],
          "居住地址(選填/不可超過200字)": row[13],
          "居住縣市鄉鎮(請選代碼)": this.formatPostCode(row[13]), // 用函式
          "發病日(提醒：如發病日晚於報告日期，將因系統檢核錯誤而無法於法傳系統中修改該筆通報單資料)(請依格式填寫)": '',
          "診斷日(請依格式填寫)": row[0],
          "檢體採檢(有/無)": '',
          "主要症狀(有/無)": '',
          "新增原因(不可超過200字)": ''
        }
      })

      console.log(jsonData)

      let jsonWorkSheet = xlsx.utils.json_to_sheet(jsonData)

      let workBook = {
        SheetNames: ['jsonWorkSheet'],
        Sheets: {
          'jsonWorkSheet': jsonWorkSheet,
        }
      }

      xlsx.writeFile(workBook, `./${name}_CDC.xlsx`)
      this.resetFileInput()
    },
    formatBirthday(date) {
      const dateArray = date.split('.')
      dateArray[0] = (Number(dateArray[0]) + 1911).toString()
      return dateArray.join('.')
    },
    formatPostCode(address) {
      const county = this.getCounty(address)
      const township = this.getTownship(address.substring(3, address.length - 1))
      return addressMap[county]?.[township] || ''
    },
    getCounty(address) {
      let str = address
      if (str.indexOf('縣') !== -1 ) {
        return str.substring(0, str.indexOf('縣'))
      } else if (str.indexOf('市') !== -1 ) {
        return str.substring(0, str.indexOf('市'))
      } 
      return ''
    },
    getTownship(address) {
      let str = address
      if (str.indexOf('區') !== -1 ) {
        return str.substring(0, str.indexOf('區'))
      } else if (str.indexOf('鎮') !== -1 ) {
        return str.substring(0, str.indexOf('鎮'))
      } else if (str.indexOf('市') !== -1 ) {
        return str.substring(0, str.indexOf('市'))
      } else if (str.indexOf('鄉') !== -1 ) {
        return str.substring(0, str.indexOf('鄉'))
      } 
      return ''
    },
    resetFileInput() {
      this.$refs.fileInput.value=null;
    }
  }
}
</script>

<style>
#app {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
  margin-top: 60px;
}
</style>
