<template>
  <div id="app">
    <h1>快篩站轉CDC格式</h1>
    <p>選擇快篩站報表(.xlsx)，即會跳出轉換後的檔案供存檔</p>
    <div>
      <input type="file" @change="handleFileChange" ref="fileInput" id="fileInput" class="hiddenInput">
      <el-button  @click="triggerFileUpload" :loading="isConverting">選取檔案</el-button>
    </div>
  </div>
</template>

<script>
import readXlsxFile from 'read-excel-file'
import xlsx from 'xlsx'
import { Notification } from 'element-ui'

const addressMap = {
  "基隆": {
    "中正": "1101-基隆市-中正區",
    "七堵": "1102-基隆市-七堵區",
    "暖暖": "1103-基隆市-暖暖區",
    "仁愛": "1104-基隆市-仁愛區",
    "中山": "1105-基隆市-中山區",
    "安樂": "1106-基隆市-安樂區",
    "信義": "1107-基隆市-信義區"
  },
  "台北": {
    "松山": "0101-台北市-松山區",
    "大安": "0102-台北市-大安區",
    "大同": "0109-台北市-大同區",
    "中山": "0110-台北市-中山區",
    "內湖": "0111-台北市-內湖區",
    "南港": "0112-台北市-南港區",
    "士林": "0115-台北市-士林區",
    "北投": "0116-台北市-北投區",
    "信義": "0117-台北市-信義區",
    "中正": "0118-台北市-中正區",
    "萬華": "0119-台北市-萬華區",
    "文山": "0120-台北市-文山區"
  },
  "臺北": {
    "松山": "0101-台北市-松山區",
    "大安": "0102-台北市-大安區",
    "大同": "0109-台北市-大同區",
    "中山": "0110-台北市-中山區",
    "內湖": "0111-台北市-內湖區",
    "南港": "0112-台北市-南港區",
    "士林": "0115-台北市-士林區",
    "北投": "0116-台北市-北投區",
    "信義": "0117-台北市-信義區",
    "中正": "0118-台北市-中正區",
    "萬華": "0119-台北市-萬華區",
    "文山": "0120-台北市-文山區"
  },
  "新北": {
    "板橋": "3101-新北市-板橋區",
    "三重": "3102-新北市-三重區",
    "永和": "3103-新北市-永和區",
    "中和": "3104-新北市-中和區",
    "新店": "3105-新北市-新店區",
    "新莊": "3106-新北市-新莊區",
    "樹林": "3107-新北市-樹林區",
    "鶯歌": "3108-新北市-鶯歌區",
    "三峽": "3109-新北市-三峽區",
    "淡水": "3110-新北市-淡水區",
    "汐止": "3111-新北市-汐止區",
    "瑞芳": "3112-新北市-瑞芳區",
    "土城": "3113-新北市-土城區",
    "蘆洲": "3114-新北市-蘆洲區",
    "五股": "3115-新北市-五股區",
    "泰山": "3116-新北市-泰山區",
    "林口": "3117-新北市-林口區",
    "深坑": "3118-新北市-深坑區",
    "石碇": "3119-新北市-石碇區",
    "坪林": "3120-新北市-坪林區",
    "三芝": "3121-新北市-三芝區",
    "石門": "3122-新北市-石門區",
    "八里": "3123-新北市-八里區",
    "平溪": "3124-新北市-平溪區",
    "雙溪": "3125-新北市-雙溪區",
    "貢寮": "3126-新北市-貢寮區",
    "金山": "3127-新北市-金山區",
    "萬里": "3128-新北市-萬里區",
    "烏來": "3129-新北市-烏來區"
  },
  "桃園": {
    "桃園": "3201-桃園市-桃園區",
    "中壢": "3202-桃園市-中壢區",
    "大溪": "3203-桃園市-大溪區",
    "楊梅": "3204-桃園市-楊梅區",
    "蘆竹": "3205-桃園市-蘆竹區",
    "大園": "3206-桃園市-大園區",
    "龜山": "3207-桃園市-龜山區",
    "八德": "3208-桃園市-八德區",
    "龍潭": "3209-桃園市-龍潭區",
    "平鎮": "3210-桃園市-平鎮區",
    "新屋": "3211-桃園市-新屋區",
    "觀音": "3212-桃園市-觀音區",
    "復興": "3213-桃園市-復興區"
  },
  "新竹": {
    "東": "1201-新竹市-東　區",
    "北": "1204-新竹市-北　區",
    "香山": "1205-新竹市-香山區",
    "關西": "3301-新竹縣-關西鎮",
    "新埔": "3302-新竹縣-新埔鎮",
    "竹東": "3303-新竹縣-竹東鎮",
    "竹北": "3305-新竹縣-竹北市",
    "湖口": "3306-新竹縣-湖口鄉",
    "橫山": "3307-新竹縣-橫山鄉",
    "新豐": "3308-新竹縣-新豐鄉",
    "芎林": "3309-新竹縣-芎林鄉",
    "寶山": "3310-新竹縣-寶山鄉",
    "北埔": "3311-新竹縣-北埔鄉",
    "峨眉": "3312-新竹縣-峨眉鄉",
    "尖石": "3313-新竹縣-尖石鄉",
    "五峰": "3314-新竹縣-五峰鄉"
  },
  "苗栗": {
    "苗栗": "3501-苗栗縣-苗栗市",
    "苑裡": "3502-苗栗縣-苑裡鎮",
    "通霄": "3503-苗栗縣-通霄鎮",
    "竹南": "3504-苗栗縣-竹南鎮",
    "頭份": "3505-苗栗縣-頭份市",
    "後龍": "3506-苗栗縣-後龍鎮",
    "卓蘭": "3507-苗栗縣-卓蘭鎮",
    "大湖": "3508-苗栗縣-大湖鄉",
    "公館": "3509-苗栗縣-公館鄉",
    "銅鑼": "3510-苗栗縣-銅鑼鄉",
    "南庄": "3511-苗栗縣-南庄鄉",
    "頭屋": "3512-苗栗縣-頭屋鄉",
    "三義": "3513-苗栗縣-三義鄉",
    "西湖": "3514-苗栗縣-西湖鄉",
    "造橋": "3515-苗栗縣-造橋鄉",
    "三灣": "3516-苗栗縣-三灣鄉",
    "獅潭": "3517-苗栗縣-獅潭鄉",
    "泰安": "3518-苗栗縣-泰安鄉"
  },
  "台中": {
    "豐原": "0301-台中市-豐原區",
    "東勢": "0302-台中市-東勢區",
    "大甲": "0303-台中市-大甲區",
    "清水": "0304-台中市-清水區",
    "沙鹿": "0305-台中市-沙鹿區",
    "梧棲": "0306-台中市-梧棲區",
    "后里": "0307-台中市-后里區",
    "神岡": "0308-台中市-神岡區",
    "潭子": "0309-台中市-潭子區",
    "大雅": "0310-台中市-大雅區",
    "新社": "0311-台中市-新社區",
    "石岡": "0312-台中市-石岡區",
    "外埔": "0313-台中市-外埔區",
    "大安": "0314-台中市-大安區",
    "烏日": "0315-台中市-烏日區",
    "大肚": "0316-台中市-大肚區",
    "龍井": "0317-台中市-龍井區",
    "霧峰": "0318-台中市-霧峰區",
    "太平": "0319-台中市-太平區",
    "大里": "0320-台中市-大里區",
    "和平": "0321-台中市-和平區",
    "中": "0322-台中市-中　區",
    "東": "0323-台中市-東　區",
    "西": "0324-台中市-西　區",
    "南": "0325-台中市-南　區",
    "北": "0326-台中市-北　區",
    "西屯": "0327-台中市-西屯區",
    "南屯": "0328-台中市-南屯區",
    "北屯": "0329-台中市-北屯區"
  },
  "彰化": {
    "彰化": "3701-彰化縣-彰化市",
    "鹿港": "3702-彰化縣-鹿港鎮",
    "和美": "3703-彰化縣-和美鎮",
    "北斗": "3704-彰化縣-北斗鎮",
    "員林": "3705-彰化縣-員林市",
    "溪湖": "3706-彰化縣-溪湖鎮",
    "田中": "3707-彰化縣-田中鎮",
    "二林": "3708-彰化縣-二林鎮",
    "線西": "3709-彰化縣-線西鄉",
    "伸港": "3710-彰化縣-伸港鄉",
    "福興": "3711-彰化縣-福興鄉",
    "秀水": "3712-彰化縣-秀水鄉",
    "花壇": "3713-彰化縣-花壇鄉",
    "芬園": "3714-彰化縣-芬園鄉",
    "大村": "3715-彰化縣-大村鄉",
    "埔鹽": "3716-彰化縣-埔鹽鄉",
    "埔心": "3717-彰化縣-埔心鄉",
    "永靖": "3718-彰化縣-永靖鄉",
    "社頭": "3719-彰化縣-社頭鄉",
    "二水": "3720-彰化縣-二水鄉",
    "田尾": "3721-彰化縣-田尾鄉",
    "埤頭": "3722-彰化縣-埤頭鄉",
    "芳苑": "3723-彰化縣-芳苑鄉",
    "大城": "3724-彰化縣-大城鄉",
    "竹塘": "3725-彰化縣-竹塘鄉",
    "溪州": "3726-彰化縣-溪州鄉"
  },
  "南投": {
    "南投": "3801-南投縣-南投市",
    "埔里": "3802-南投縣-埔里鎮",
    "草屯": "3803-南投縣-草屯鎮",
    "竹山": "3804-南投縣-竹山鎮",
    "集集": "3805-南投縣-集集鎮",
    "名間": "3806-南投縣-名間鄉",
    "鹿谷": "3807-南投縣-鹿谷鄉",
    "中寮": "3808-南投縣-中寮鄉",
    "魚池": "3809-南投縣-魚池鄉",
    "國姓": "3810-南投縣-國姓鄉",
    "水里": "3811-南投縣-水里鄉",
    "信義": "3812-南投縣-信義鄉",
    "仁愛": "3813-南投縣-仁愛鄉"
  },
  "雲林": {
    "斗六": "3901-雲林縣-斗六市",
    "斗南": "3902-雲林縣-斗南鎮",
    "虎尾": "3903-雲林縣-虎尾鎮",
    "西螺": "3904-雲林縣-西螺鎮",
    "土庫": "3905-雲林縣-土庫鎮",
    "北港": "3906-雲林縣-北港鎮",
    "古坑": "3907-雲林縣-古坑鄉",
    "大埤": "3908-雲林縣-大埤鄉",
    "莿桐": "3909-雲林縣-莿桐鄉",
    "林內": "3910-雲林縣-林內鄉",
    "二崙": "3911-雲林縣-二崙鄉",
    "崙背": "3912-雲林縣-崙背鄉",
    "麥寮": "3913-雲林縣-麥寮鄉",
    "東勢": "3914-雲林縣-東勢鄉",
    "褒忠": "3915-雲林縣-褒忠鄉",
    "台西": "3916-雲林縣-台西鄉",
    "元長": "3917-雲林縣-元長鄉",
    "四湖": "3918-雲林縣-四湖鄉",
    "口湖": "3919-雲林縣-口湖鄉",
    "水林": "3920-雲林縣-水林鄉"
  },
  "嘉義": {
    "東": "2201-嘉義市-東　區",
    "西": "2202-嘉義市-西　區",
    "朴子": "4001-嘉義縣-朴子市",
    "布袋": "4002-嘉義縣-布袋鎮",
    "大林": "4003-嘉義縣-大林鎮",
    "民雄": "4004-嘉義縣-民雄鄉",
    "溪口": "4005-嘉義縣-溪口鄉",
    "新港": "4006-嘉義縣-新港鄉",
    "六腳": "4007-嘉義縣-六腳鄉",
    "東石": "4008-嘉義縣-東石鄉",
    "義竹": "4009-嘉義縣-義竹鄉",
    "鹿草": "4010-嘉義縣-鹿草鄉",
    "太保": "4011-嘉義縣-太保市",
    "水上": "4012-嘉義縣-水上鄉",
    "中埔": "4013-嘉義縣-中埔鄉",
    "竹崎": "4014-嘉義縣-竹崎鄉",
    "梅山": "4015-嘉義縣-梅山鄉",
    "番路": "4016-嘉義縣-番路鄉",
    "大埔": "4017-嘉義縣-大埔鄉",
    "阿里山": "4018-嘉義縣-阿里山鄉"
  },
  "台南": {
    "新營": "0501-台南市-新營區",
    "鹽水": "0502-台南市-鹽水區",
    "白河": "0503-台南市-白河區",
    "麻豆": "0504-台南市-麻豆區",
    "佳里": "0505-台南市-佳里區",
    "新化": "0506-台南市-新化區",
    "善化": "0507-台南市-善化區",
    "學甲": "0508-台南市-學甲區",
    "柳營": "0509-台南市-柳營區",
    "後壁": "0510-台南市-後壁區",
    "東山": "0511-台南市-東山區",
    "下營": "0512-台南市-下營區",
    "六甲": "0513-台南市-六甲區",
    "官田": "0514-台南市-官田區",
    "大內": "0515-台南市-大內區",
    "西港": "0516-台南市-西港區",
    "七股": "0517-台南市-七股區",
    "將軍": "0518-台南市-將軍區",
    "北門": "0519-台南市-北門區",
    "新市": "0520-台南市-新市區",
    "安定": "0521-台南市-安定區",
    "山上": "0522-台南市-山上區",
    "玉井": "0523-台南市-玉井區",
    "楠西": "0524-台南市-楠西區",
    "南化": "0525-台南市-南化區",
    "左鎮": "0526-台南市-左鎮區",
    "仁德": "0527-台南市-仁德區",
    "歸仁": "0528-台南市-歸仁區",
    "關廟": "0529-台南市-關廟區",
    "龍崎": "0530-台南市-龍崎區",
    "永康": "0531-台南市-永康區",
    "東": "0532-台南市-東區",
    "南": "0533-台南市-南區",
    "中西": "0534-台南市-中西區",
    "北": "0535-台南市-北區",
    "安南": "0537-台南市-安南區",
    "安平": "0538-台南市-安平區"
  },
  "高雄": {
    "鳳山": "0701-高雄市-鳳山區",
    "岡山": "0702-高雄市-岡山區",
    "旗山": "0703-高雄市-旗山區",
    "美濃": "0704-高雄市-美濃區",
    "林園": "0705-高雄市-林園區",
    "大寮": "0706-高雄市-大寮區",
    "大樹": "0707-高雄市-大樹區",
    "仁武": "0708-高雄市-仁武區",
    "大社": "0709-高雄市-大社區",
    "鳥松": "0710-高雄市-鳥松區",
    "橋頭": "0711-高雄市-橋頭區",
    "燕巢": "0712-高雄市-燕巢區",
    "田寮": "0713-高雄市-田寮區",
    "阿蓮": "0714-高雄市-阿蓮區",
    "路竹": "0715-高雄市-路竹區",
    "湖內": "0716-高雄市-湖內區",
    "茄萣": "0717-高雄市-茄萣區",
    "永安": "0718-高雄市-永安區",
    "彌陀": "0719-高雄市-彌陀區",
    "梓官": "0720-高雄市-梓官區",
    "六龜": "0721-高雄市-六龜區",
    "甲仙": "0722-高雄市-甲仙區",
    "杉林": "0723-高雄市-杉林區",
    "內門": "0724-高雄市-內門區",
    "茂林": "0725-高雄市-茂林區",
    "桃源": "0726-高雄市-桃源區",
    "那瑪夏": "0727-高雄市-那瑪夏區",
    "鹽埕": "0728-高雄市-鹽埕區",
    "鼓山": "0729-高雄市-鼓山區",
    "左營": "0730-高雄市-左營區",
    "楠梓": "0731-高雄市-楠梓區",
    "三民": "0732-高雄市-三民區",
    "新興": "0733-高雄市-新興區",
    "前金": "0734-高雄市-前金區",
    "苓雅": "0735-高雄市-苓雅區",
    "前鎮": "0736-高雄市-前鎮區",
    "旗津": "0737-高雄市-旗津區",
    "小港": "0738-高雄市-小港區"
  },
  "屏東": {
    "屏東": "4301-屏東縣-屏東市",
    "潮州": "4302-屏東縣-潮州鎮",
    "東港": "4303-屏東縣-東港鎮",
    "恆春": "4304-屏東縣-恆春鎮",
    "萬丹": "4305-屏東縣-萬丹鄉",
    "長治": "4306-屏東縣-長治鄉",
    "麟洛": "4307-屏東縣-麟洛鄉",
    "九如": "4308-屏東縣-九如鄉",
    "里港": "4309-屏東縣-里港鄉",
    "鹽埔": "4310-屏東縣-鹽埔鄉",
    "高樹": "4311-屏東縣-高樹鄉",
    "萬巒": "4312-屏東縣-萬巒鄉",
    "內埔": "4313-屏東縣-內埔鄉",
    "竹田": "4314-屏東縣-竹田鄉",
    "新埤": "4315-屏東縣-新埤鄉",
    "枋寮": "4316-屏東縣-枋寮鄉",
    "新園": "4317-屏東縣-新園鄉",
    "崁頂": "4318-屏東縣-崁頂鄉",
    "林邊": "4319-屏東縣-林邊鄉",
    "南州": "4320-屏東縣-南州鄉",
    "佳冬": "4321-屏東縣-佳冬鄉",
    "琉球": "4322-屏東縣-琉球鄉",
    "車城": "4323-屏東縣-車城鄉",
    "滿州": "4324-屏東縣-滿州鄉",
    "枋山": "4325-屏東縣-枋山鄉",
    "三地門": "4326-屏東縣-三地門鄉",
    "霧台": "4327-屏東縣-霧台鄉",
    "瑪家": "4328-屏東縣-瑪家鄉",
    "泰武": "4329-屏東縣-泰武鄉",
    "來義": "4330-屏東縣-來義鄉",
    "春日": "4331-屏東縣-春日鄉",
    "獅子": "4332-屏東縣-獅子鄉",
    "牡丹": "4333-屏東縣-牡丹鄉"
  },
  "宜蘭": {
    "宜蘭": "3401-宜蘭縣-宜蘭市",
    "羅東": "3402-宜蘭縣-羅東鎮",
    "蘇澳": "3403-宜蘭縣-蘇澳鎮",
    "頭城": "3404-宜蘭縣-頭城鎮",
    "礁溪": "3405-宜蘭縣-礁溪鄉",
    "壯圍": "3406-宜蘭縣-壯圍鄉",
    "員山": "3407-宜蘭縣-員山鄉",
    "冬山": "3408-宜蘭縣-冬山鄉",
    "五結": "3409-宜蘭縣-五結鄉",
    "三星": "3410-宜蘭縣-三星鄉",
    "大同": "3411-宜蘭縣-大同鄉",
    "南澳": "3412-宜蘭縣-南澳鄉"
  },
  "花蓮": {
    "花蓮": "4501-花蓮縣-花蓮市",
    "鳳林": "4502-花蓮縣-鳳林鎮",
    "玉里": "4503-花蓮縣-玉里鎮",
    "新城": "4504-花蓮縣-新城鄉",
    "吉安": "4505-花蓮縣-吉安鄉",
    "壽豐": "4506-花蓮縣-壽豐鄉",
    "光復": "4507-花蓮縣-光復鄉",
    "豐濱": "4508-花蓮縣-豐濱鄉",
    "瑞穗": "4509-花蓮縣-瑞穗鄉",
    "富里": "4510-花蓮縣-富里鄉",
    "秀林": "4511-花蓮縣-秀林鄉",
    "萬榮": "4512-花蓮縣-萬榮鄉",
    "卓溪": "4513-花蓮縣-卓溪鄉"
  },
  "台東": {
    "台東": "4601-台東縣-台東市",
    "成功": "4602-台東縣-成功鎮",
    "關山": "4603-台東縣-關山鎮",
    "卑南": "4604-台東縣-卑南鄉",
    "大武": "4605-台東縣-大武鄉",
    "太麻里": "4606-台東縣-太麻里鄉",
    "東河": "4607-台東縣-東河鄉",
    "長濱": "4608-台東縣-長濱鄉",
    "鹿野": "4609-台東縣-鹿野鄉",
    "池上": "4610-台東縣-池上鄉",
    "綠島": "4611-台東縣-綠島鄉",
    "延平": "4612-台東縣-延平鄉",
    "海端": "4613-台東縣-海端鄉",
    "達仁": "4614-台東縣-達仁鄉",
    "金峰": "4615-台東縣-金峰鄉",
    "蘭嶼": "4616-台東縣-蘭嶼鄉"
  },
  "澎湖": {
    "馬公": "4401-澎湖縣-馬公市",
    "湖西": "4402-澎湖縣-湖西鄉",
    "白沙": "4403-澎湖縣-白沙鄉",
    "西嶼": "4404-澎湖縣-西嶼鄉",
    "望安": "4405-澎湖縣-望安鄉",
    "七美": "4406-澎湖縣-七美鄉"
  },
  "金門": {
    "金城": "9001-金門縣-金城鎮",
    "金沙": "9002-金門縣-金沙鎮",
    "金湖": "9003-金門縣-金湖鎮",
    "金寧": "9004-金門縣-金寧鄉",
    "烈嶼": "9005-金門縣-烈嶼鄉",
    "烏坵": "9006-金門縣-烏坵鄉"
  },
  "連江": {
    "南竿": "9101-連江縣-南竿鄉",
    "北竿": "9102-連江縣-北竿鄉",
    "莒光": "9103-連江縣-莒光鄉",
    "東引": "9104-連江縣-東引鄉"
  }
}

export default {
  name: 'App',
  data() {
    return {
      isConverting: false
    }
  },
  mounted() {
    window.addEventListener("unhandledrejection", this.handleError)
  },
  beforeDestroy() {
    window.removeEventListener("unhandledrejection", this.handleError)
  },
  methods: {
    handleError() {
      this.resetFileInput()
      Notification({
        title: '錯誤',
        message: '檔案格式可能有誤、或有密碼保護',
        type: 'error',
        position: 'bottom-right'
      })
    },
    triggerFileUpload() {
      document.querySelector('#fileInput').click()
    },
    handleFileChange(e) {
      this.isConverting = true
      const file = e.target.files[0]
      readXlsxFile(file).then((rows) => {
        this.exportCdcExcel(rows, file.name.split('.')[0])
      })
    },
    exportCdcExcel(rows, name) {
      rows.shift()
      rows.shift()
      rows.shift() // 移除多餘兩行與表頭
      let jsonData = rows.map(row => {
        return {
          "身份證字號/護照號碼(不可超過10碼)": row[5],
          "姓名(不可超過30字)": row[4],
          "出生日期(請依格式填寫)": this.formatBirthday(row[7]),
          "性別(請選代碼)": this.formatGender(row[6]),
          "職業(請選代碼)": '21-其他',
          "國籍別暨非本國居民身分(請選代碼)": this.formatCitizenship(row[5]),
          "國家(請選代碼)": this.formatCountry(row[5]),
          "公司電話(選填/不可超過30碼)": this.formatPhone(row[9]),
          "手機號碼(選填/不可超過30碼)": this.formatPhone(row[10]),
          "居住地址(選填/不可超過200字)": row[11],
          "居住縣市鄉鎮(請選代碼)": this.formatPostCode(row[11]),
          "發病日(提醒：如發病日晚於報告日期，將因系統檢核錯誤而無法於法傳系統中修改該筆通報單資料)(請依格式填寫)": this.formatDate(row[0]),
          "診斷日(請依格式填寫)": this.formatDate(row[0]),
          "檢體採檢(有/無)": '是',
          "主要症狀(有/無)": '無',
          "新增原因(不可超過200字)": '篩檢'
        }
      })

      const jsonWorkSheet = xlsx.utils.json_to_sheet(jsonData)

      let workBook = {
        SheetNames: ['jsonWorkSheet'],
        Sheets: {
          'jsonWorkSheet': jsonWorkSheet,
        }
      }

      xlsx.writeFile(workBook, `./${name}_CDC.xlsx`)
      this.resetFileInput()
    },
    formatDate(date) {
      const dateString = date.toString()
      return `${Number(dateString.substring(0, 3)) + 1911}-${dateString.substring(3, 5)}-${dateString.substring(5, 7)}`
    },
    formatBirthday(date) {
      const dateString = date.toString()
      if (dateString.length === 6) {
        return `${Number(dateString.substring(0, 2)) + 1911}-${dateString.substring(2, 4)}-${dateString.substring(4, 6)}`
      }
      if (dateString.length === 7) {
        return `${Number(dateString.substring(0, 3)) + 1911}-${dateString.substring(3, 5)}-${dateString.substring(5, 7)}`
      }
      return ''
    },
    formatPhone(phone) {
      if (phone === null || phone === '') {
        return ''
      }
      return phone.toString()
    },
    formatGender(gender) {
      return gender === '男' ? 'M-男性' : 'F-女性'
    },
    formatCitizenship(id) {
      const firstCode = Number(id.toString().substring(1, 2))
      if ( firstCode === 1 || firstCode === 2) {
        return '0-本國人'
      }
      return '1-外國人-11-未知'
    },
    formatCountry(id) {
      const firstCode = Number(id.toString().substring(1, 2))
      if ( firstCode === 1 || firstCode === 2) {
        return '158-中華民國'
      }
      return '000-未知'
    },
    formatPostCode(address) {
      if (address === '' || address === null) {
        return '不詳'
      }
      const county = this.getCounty(address.toString())
      const township = this.getTownship(address.toString().substring(3, address.length - 1))
      return addressMap[county]?.[township] || '不詳'
    },
    getCounty(address) {
      let str = address
      if (str.indexOf('縣') !== -1 ) {
        return str.substring(0, str.indexOf('縣'))
      } else if (str.indexOf('市') !== -1 ) {
        return str.substring(0, str.indexOf('市'))
      } 
      return ''
    },
    getTownship(address) {
      let str = address
      if (str.indexOf('區') !== -1 ) {
        return str.substring(0, str.indexOf('區'))
      } else if (str.indexOf('鎮') !== -1 ) {
        return str.substring(0, str.indexOf('鎮'))
      } else if (str.indexOf('市') !== -1 ) {
        return str.substring(0, str.indexOf('市'))
      } else if (str.indexOf('鄉') !== -1 ) {
        return str.substring(0, str.indexOf('鄉'))
      } 
      return ''
    },
    resetFileInput() {
      this.$refs.fileInput.value=null
      this.isConverting = false
    }
  }
}
</script>

<style>
#app {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
  margin-top: 60px;
}

.hiddenInput {
  display: none;
}

.alert-block {
  width: 50%;
  margin: 10px auto;
}
</style>
